# 洗牌功能，shuffle的作用是随机打乱列表
from random import shuffle
import random

# pip install numpy,记录一下分数
import numpy as np

from sys import exit

# 初始化扑克牌
playing_cards = {
    "黑桃A": 1, "黑桃2": 2, "黑桃3": 3, "黑桃4": 4, "黑桃5": 5, "黑桃6": 6, "黑桃7": 7, "黑桃8": 8, "黑桃9": 9, "黑桃10": 10, "黑桃J": 10, "黑桃Q": 10, "黑桃K": 10, 
    "红桃A": 1, "红桃2": 2, "红桃3": 3, "红桃4": 4, "红桃5": 5, "红桃6": 6, "红桃7": 7, "红桃8": 8, "红桃9": 9, "红桃10": 10, "红桃J": 10, "红桃Q": 10, "红桃K": 10,
    "梅花A": 1, "梅花2": 2, "梅花3": 3, "梅花4": 4, "梅花5": 5, "梅花6": 6, "梅花7": 7, "梅花8": 8, "梅花9": 9, "梅花10": 10, "梅花J": 10, "梅花Q": 10, "梅花K": 10,
    "方片A": 1, "方片2": 2, "方片3": 3, "方片4": 4, "方片5": 5, "方片6": 6, "方片7": 7, "方片8": 8, "方片9": 9, "方片10": 10, "方片J": 10, "方片Q": 10, "方片K": 10,
}


poker_name = list(playing_cards.keys())
# 扑克的数量




